Repository: rzelazko/lime-tracker
Catalog: src/locale/messages.*.xlf
Languages: pl

# routerLink-epilepsy
source: /epilepsy
pl: /epilepsja

# routerLink-register-confirm
source: /register/confirm
pl: /rejestracja/potwierdz

# routerLink-login
source: /login
pl: /logowanie

# routing-login
source: login
pl: logowanie

# routing-logout
source: logout
pl: wyloguj

# routing-register
source: register
pl: rejestracja

# routing-register-confirm
source: register/confirm
pl: rejestracja/potwierdz

# title-verify-email
source: Verify Email
pl: Zweryfikuj Adres Email

# routing-epilepsy
source: epilepsy
pl: epilepsja

# title-dashboard
source: Dashboard
pl: Pulpit

# routing-charts
source: charts
pl: wykresy

# title-charts
source: Charts
pl: Wykresy

# routing-charts-year
source: charts/:year
pl: wykresy/:year

# routing-periods
source: periods
pl: okresy

# title-periods
source: Periods
pl: Okresy

# routing-periods-add
source: periods/add
pl: okresy/dodaj

# title-add-period
source: Add Period
pl: Dodaj Okres

# routing-periods-update
source: periods/update/:id
pl: okresy/aktualizuj/:id

# title-update-period
source: Update Period
pl: Aktualizuj informacje o okresie

# routing-reports
source: reports
pl: raporty

# title-reports
source: Reports
pl: Raporty

# routing-reports-year
source: reports/:year
pl: raporty/:year

# routing-seizures
source: seizures
pl: napady

# title-seizures
source: Seizures
pl: Napady

# routing-seizures-add
source: seizures/add
pl: napady/dodaj

# title-add-seizure
source: Add Seizure
pl: Dodaj Napad

# routing-seizures-update
source: seizures/update/:id
pl: napady/aktualizuj/:id

# title-update-seizure
source: Update Seizure
pl: Aktualizuj Dane Napadu

# routing-medications
source: medications
pl: leki

# title-medications
source: Medications
pl: Leki

# routing-medications-add
source: medications/add
pl: leki/dodaj

# title-add-medication
source: Add Medication
pl: Dodaj Lek

# routing-medications-update
source: medications/update/:id
pl: leki/aktualizuj/:id

# title-update-medication
source: Update Medication
pl: Aktualizuj Lek

# routing-events
source: events
pl: wydarzenia

# title-events
source: Events
pl: Wydarzenia

# routing-events-add
source: events/add
pl: wydarzenia/dodaj

# title-add-event
source: Add Event
pl: Dodaj Zdarzenie

# routing-evetns-update
source: events/update/:id
pl: wydarzenia/aktualizuj/:id

# title-update-event
source: Update Event
pl: Aktualizuj Zdarzenie

# routing-profile
source: account
pl: konto

# title-profile
source: Manage account
pl: Twoje konto

# seizure-trigger-lights
source: Lights
pl: Światła

# seizure-trigger-period
source: Period
pl: Okres

# seizure-trigger-forgotten-medication
source: Forgotten medication
pl: Pominięty lek

# seizure-trigger-stress
source: Stress
pl: Stres

# seizure-trigger-change-medication
source: Change of medication
pl: Zmiana leku

# seizure-trigger-sleepless-night
source: Sleepless night
pl: Brak snu

# seizure-type-simple-focal
source: Simple focal seizure
pl: Napad częściowy prosty

# seizure-type-complex-focal
source: Complex focal seizure
pl: Napad częściowy złożony

# seizure-type-absence
source: Absence seizure
pl: Napad nieświadomości

# seizure-type-clonic
source: Clonic seizure
pl: Naapd kloniczny

# seizure-type-tonic
source: Tonic seizure
pl: Napad toniczny

# seizure-type-tonic-clonic
source: Tonic-clonic seizure
pl: Napad toniczno-kloniczny

# seizure-type-tonic-atonic
source: Atonic seizure
pl: Napad atoniczny

# seizure-type-tonic-aura
source: Aura only
pl: Tylko aura

# seizure-type-secondary-generalized
source: Secondary generalized seizure
pl: Napad częściowy, wtórnie uogólniony

# seizure-type-other
source: Other / unknown
pl: Inny / nieznany

# login-welcome
source: Welcome again!
pl: Witaj ponownie!

# error-connection
source: Connection to backend failed. Please try again, and if the problem persists, contact the <a href="https://www.webperfekt.pl/">administrator</a>.
pl: Połączenie z serwerem zostało przerwane. Prosimy spróbować ponownie później, jeśli problem się powtarza prosimy o kontakt z <a href="https://www.webperfekt.pl/">administratorem</a>.

# login-error-auth
source: Authentication failed - please provide valid credentials
pl: Uwierzytelnianie nie powiodło się - proszę podać prawidłowe dane

# placeholder-email
source: Your email
pl: Twój email

# error-email-required
source: Email is required
pl: Email jest wymagany

# error-email-invalid
source: Email is invalid
pl: Email jest niepoprawny

# placeholder-password
source: Your password
pl: Twoje hasło

# error-provide-password
source: Please provide valid passowrd
pl: Proszę podać poprawne hasło

# action-login
source: Log in
pl: Zaloguj się

# register-welcome
source: Register to the best epilepsy journal!
pl: Utwórz konto w najlepszej aplikacji monitorującej epilepsję!

# error-email-taken
source: Email already taken
pl: Podany email jest ju

# error-passwrod-weak
source: Password is too weak
pl: Hasło jest zbyt proste

# register-error-default
source: Registration failed - try different data. If problem persists please contact the <a href="https://www.webperfekt.pl/">administrator</a>.
pl: Rejestracja nie powiodła się - spróbuj podać inne dane. Jeśli problem się powtarza skontaktuj się z <a href="https://www.webperfekt.pl/">administratorem</a>.

# placeholder-name
source: Your name
pl: Twoje imię i nazwisko

# error-name-required
source: Your name is required
pl: Twoje imię i nazwisko jest wymagane

# error-name-invalid
source: Your name is invalid
pl: Twoje imię i nazwisko jest niepoprawne

# error-password-6-100
source: Has to be 6 - 100 characters long
pl: Powinno składać się z 6 - 100 znaków

# placeholder-confirm-password
source: Confirm password
pl: Powtórz hasło

# error-confirm-password-required
source: Confirm password is required
pl: Pole powtórz hasło jest wymagane

# error-confirm-password-not-the-same
source: Password and confirm password must be the same
pl: Hasło i powtórz hasło muszą być takie same

# label-i-am-female
source: I am female
pl: Jestem kobietą

# action-register
source: Register
pl: Utwórz konto

# verify-welcome
source: Almoast there
pl: Już prawie

# verify-header
source: Thank You for Registering!
pl: Dziękujemy za rejestrację!

# verify-email-sent
source: We have sent a confirmation email.
pl: Wysłaliśmy email z linkiem weryfikacyjnym.

# verify-email-sent-to
source: To
pl: Do

# verify-email-sent-date
source: At
pl: Wysłano

# verify-email-resend-info
source: Resend possible after an hour.
pl: Ponowne wysłanie możliwe za godzinę.

# verify-check-email
source: Please check your email and click on the link to verify your email address.
pl: Proszę sprawdzić pocztę i kliknąć na link aby potwierdzić Twój adres email.

# verify-button-resend
source: Re-send confirmation email
pl: Wyślij ponownie

# routerLink-logout
source: /logout
pl: /wyloguj

# login-action
source: Log in
pl: Zaloguj się

# delete-dialog-title
source: Delete {{ type }}?
pl: Usunąć {{ type }}?

# delete-dialog-content
source: Delete {{ type }}: {{ title }}?
pl: Usunąć {{ type }}: {{ title }}?

# dialog-option-no
source: No
pl: Nie

# dialog-option-yes
source: Yes
pl: Tak

# confirm-delete-type-event
source: event
pl: wydarzenie

# confirm-delete-type-medication
source: medication
pl: lek

# confirm-delete-type-seizure
source: seizure
pl: napad

# confirm-delete-type-period
source: period
pl: okres

# confirm-delete-type-unknown
source: unknown
pl: nieznane

# table-column-occurred
source: Occurred
pl: Wystąpił

# table-column-name
source: Name
pl: Nazwa

# table-column-type
source: Type
pl: Rodzaj

# table-column-triggers
source: Triggers
pl: Powody

# table-column-duration
source: Duration
pl: Długość

# table-column-dose
source: Dose
pl: Dawka

# table-column-start-end-date
source: Period of use
pl: Okres zażywania

# table-column-start-date
source: Start date
pl: Data rozpoczęcia

# table-column-end-date
source: End date
pl: Data zakończenia

# table-column-medication-active
source: Active
pl: Aktualny

# table-tooltip-move-to-active
source: Switch medication to currenlty taken
pl: Zmień na aktualnie zażywany

# table-tooltip-move-to-archive
source: Move to archive
pl: Zmień na archiwalny

# table-column-actions
source: Actions
pl: Akcje

source: Loading
pl: Wczytywanie

source: No data
pl: Brak danych

# action-load-more
source: Load more
pl: Wczytaj więcej

# action-refresh
source: Refresh data
pl: Odśwież dane

# tab-last-year
source: Last year
pl: Ostatni rok

# chart-heatmap-legend-day-no-seizures
source: No seizures
pl: Brak napadów

# chart-heatmap-legend-day-with-1-seizure
source: Day with one seizure
pl: Dzień z jednym napadem

# chart-heatmap-legend-day-with-2-seizures
source: Day with two seizures
pl: Dzień z dwoma napadmi

# chart-heatmap-legend-day-with-more-seizures
source: Day with more seizures
pl: Dzień z większą ilością napadów

# chart-heatmap-title
source: Seizures during a year
pl: Napady w trakcie roku

# error-message
source: Error: error.message || error
pl: Błąd: error.message || error

# chart-seizures-by-hour-axis-x
source: Hour
pl: Godzina

# chart-seizures-by-hour-title
source: Amount of seizures per time of day
pl: Liczba ataków na porę dnia

# chart-seizures-by-type-title
source: Seizure types
pl: Rodzaje napadów

# chart-summary-title
source: Seizures, medications & events
pl: Napady, leki i wydarzenia

# routerLink-epilepsy-charts
source: /epilepsy/charts
pl: /epilepsja/wykresy

# dashboard-title-last-seizure
source: Last seizure
pl: Ostatni napad

# dashboard-time-since-last-seizure
source: Time since last seizure:
pl: Czas od ostatniego napadu:

# dashboard-time-since-last-seizure-unknown
source: unknown
pl: nieznany

# routerLink-epilepsy-seizures-add
source: /epilepsy/seizures/add
pl: /epilepsja/napady/dodaj

# dashboard-action-add-seizure
source: Attack!
pl: Atakuję!

# dashboard-title-current-medications
source: Current medications
pl: Zażywane leki

# routerLink-epilepsy-medications
source: /epilepsy/medications
pl: /epilepsja/leki

# dashboard-title-last-period
source: Last period
pl: Ostatni okres

# routerLink-epilepsy-periods
source: /epilepsy/periods
pl: /epilepsja/okresy

# dashboard-title-current-period
source: Current period
pl: Aktualny okres

# dashboard-subtitle-current-period
source: Since: {{ lastPeriods[0].startDate | moment: "LL" }}
pl: Od: {{ lastPeriods[0].startDate | moment: "LL" }}

# dashboard-current-period-content-lasts
source: Lasts:
pl: Trwa:

# dashboard-last-period-content-time-since
source: Time since:
pl: Czas od:

# dashboard-title-last-events
source: Last events
pl: Ostatnie zdarzenia

# routerLink-epilepsy-events
source: /epilepsy/events
pl: /epilepsja/wydarzenia

# error-with-message
source: Error: {{ error }}
pl: Błąd: {{ error }}

# label-event-name
source: Event name
pl: Nazwa zdarzenia

# placeholder-event-name
source: Important event name
pl: Ważne zdarzenie

# error-event-name-required
source: Event name is required
pl: Nazwa zdzarzenia jest wymagana

# error-event-name-invalid
source: Event name is invalid
pl: Nazwa zdzarzenia jest niepoprawna

# label-event-occurred
source: Event occurred
pl: Wydarzenie odbyło się

# error-event-occurred-required
source: Event occurred is required
pl: Pole odbyło się jest wymagane

# error-event-occurred-invalid
source: Event occurred is invalid
pl: Pole odbyło się jest niepoprawne

# error-event-occurred-in-future
source: Event occurred cannot be in the future
pl: Pole odbyło się nie może być w przyszłości

# action-update
source: Update
pl: Aktualizuj

# action-add-event
source: Add event
pl: Dodaj zdarzenie

# action-cancel
source: Cancel
pl: Anuluj

# routerLink-epilepsy-events-add
source: /epilepsy/events/add
pl: /epilepsja/wydarzenia/dodaj

# routerLink-epilepsy-events-update
source: /epilepsy/events/update
pl: /epilepsja/wydarzenia/aktualizuj

# unexpected-error-message
source: An unexpected error occurred
pl: Wystąpił nieoczekiwany błąd

# label-medication-name
source: Medication name
pl: Nazwa leku

# error-medication-name-required
source: Medication name is required
pl: Nazwa leku jest wymagana

# error-medication-name-invalid
source: Medication name is invalid
pl: Nazwa leku jest niepoprawna

# label-medication-morning-dose
source: Morning dose
pl: Poranna dawka

# error-morning-dose-required
source: Morning dose is required
pl: Dawka poranna jest wymagana

# error-morning-dose-invalid
source: Morning dose is invalid
pl: Dawka poranna jest niepoprawna

# label-medication-noon-dose
source: Noon dose
pl: Południowa dawka

# error-noon-dose-required
source: Noon dose is required
pl: Dawka południowa jest wymagana

# error-noon-dose-invalid
source: Noon dose is invalid
pl: Dawka południowa jest niepoprawna

# label-medication-evening-dose
source: Evening dose
pl: Wieczorna dawka

# error-evening-dose-required
source: Evening dose is required
pl: Dawka wieczorna jest wymagana

# error-evening-dose-invalid
source: Evening dose is invalid
pl: Dawka wieczorna jest niepoprawna

# label-medication-start-date
source: Start date
pl: Data rozpoczęcia

# error-start-date-required
source: Start date is required
pl: Data rozpoczęcia jest wymagana

# error-start-date-invalid
source: Start date is invalid
pl: Data rozpoczęcia jest niepoprawna

# error-start-date-in-future
source: Start date cannot be in the future
pl: Data rozpoczęcia nie może być w przyszłości

# error-start-date-after-end-date
source: Start date cannot be after end date
pl: Data rozpoczęcia nie może być po dacie zakończenia

# label-medication-archived
source: Archived
pl: Archiwalny

# label-medication-end-date
source: End date
pl: Data zakończenia

# error-end-date-required
source: End date is required
pl: Data zakończenia jest wymagana

# error-end-date-invalid
source: End date is invalid
pl: Data zakończenia jest niepoprawna

# error-end-date-in-future
source: End date cannot be in the future
pl: Data zakończenia nie może być w przyszłości

# error-end-date-before-start-date
source: End date cannot be before start date
pl: Data zakończenia nie może być przed datą rozpoczęcia

# action-add-medication
source: Add medication
pl: Dodaj lek

# routerLink-epilepsy-medications-add
source: /epilepsy/medications/add
pl: /epilepsja/leki/dodaj

# routerLink-epilepsy-medications-update
source: /epilepsy/medications/update
pl: /epilepsja/leki/aktualizuj

# label-period-start-date
source: Start date
pl: Data rozpoczęcia okresu

# label-period-end-date
source: End date
pl: Data zakończenia okresu

# action-add-period
source: Add period
pl: Dodaj okres

# routerLink-epilepsy-periods-add
source: /epilepsy/periods/add
pl: /epilepsja/okresy/dodaj

# routerLink-epilepsy-periods-update
source: /epilepsy/periods/update
pl: /epilepsja/okresy/aktualizuj

# routerLink-epilepsy-reports
source: /epilepsy/reports
pl: /epilepsja/raporty

# title-reports-until-from
source: until {{ report.dateTo | moment: "L" }} (from {{ report.dateFrom | moment: "L" }})
pl: do dnia {{ report.dateTo | moment: "L" }} (od {{ report.dateFrom | moment: "L" }})

# reports-no-data
source: No reports found!
pl: Brak raportów do wyświetlenia!

# reports-seizure-name
source: Seizure: {{ case.occurred | moment: "LLL" }}
pl: Napad: {{ case.occurred | moment: "LLL" }}

# reports-seizure-type
source: Type: {{ case.type }}
pl: Rodzaj: {{ case.type }}

# reports-seizure-triggers
source: Triggers: {{ case.triggers | join }}
pl: Powody: {{ case.triggers | join }}

# reports-seizure-duration
source: Duration: {{ case.duration | humanize }}
pl: Długość: {{ case.duration | humanize }}

# reports-medication-startDate
source: Start date: {{ case.startDate | moment: "LL" }}
pl: Data rozpoczęcia: {{ case.startDate | moment: "LL" }}

# reports-medication-endDate
source: End date: {{ case.endDate | moment: "LL" }}
pl: Data zakończenia: {{ case.endDate | moment: "LL" }}

# reports-period-title
source: Period
pl: Okres

# reports-period-startDate
source: Start date: {{ case.startDate | moment: "LL" }}
pl: Początek: {{ case.startDate | moment: "LL" }}

# reports-period-endDate
source: End date: {{ case.endDate | moment: "LL" }}
pl: Koniec: {{ case.endDate | moment: "LL" }}

# label-occurred
source: Occurred
pl: Wystąpił

# error-occurred-required
source: Occurred field is required
pl: Pole wystąpił jest wymagane

# error-occurred-invalid
source: Occurred field is invalid
pl: Pole wystąpił jest niepoprawne

# error-occurred-in-future
source: Occurred cannot be in the future
pl: Wystąpił nie może być w przyszłości

# label-duration
source: Duration (min)
pl: Długość (min)

# error-seizure-duration-required
source: Seizure duration is required
pl: Długość napadu jest wymagana

# error-seizure-duration-invalid
source: Seizure duration is invalid
pl: Długość napadu jest niepoprawna

# label-seizure-type
source: Type
pl: Rodzaj

# error-seizure-type-required
source: Seizure type is required
pl: Rodzaj jest wymagany

# error-seizure-type-invalid
source: Seizure type is invalid
pl: Rodzaj jest niepoprawny

# label-seizure-triggers
source: Triggers
pl: Powody

# error-seizure-triggers-required
source: Seizure triggers is required
pl: Pole powody jest wymagane

# error-seizure-triggers-invalid
source: Seizure triggers is invalid
pl: Pole powody jest niepoprawne

# action-add-seizure
source: Add seizure
pl: Dodaj napad

# routerLink-epilepsy-seizures
source: /epilepsy/seizures
pl: /epilepsja/napady

# routerLink-epilepsy-seizures-update
source: /epilepsy/seizures/update
pl: /epilepsja/napady/aktualizuj

# error404-title
source: Error 404
pl: Błąd 404

# error404-description
source: Page you are looking for has not been found!
pl: Strona, której szukasz nie została odnaleziona!

# error404-link-back-to-dashboard
source: Open Lime Tracker dashboard
pl: Przejdź na pulpit Lime Trackera

# title-profile-name
source: Hi, {{userData.name}}
pl: Cześć, {{userData.name}}

# error-update-profile-failed
source: Update profile failed: {{ error }}
pl: Błąd podczas aktualizacji profilu: {{ error }}

# action-edit-seizure-types
source: Edit seizure types
pl: Edytuj rodzaje ataków

# action-edit-seizure-triggers
source: Edit seizure triggers
pl: Edytuj powody ataków

# error-title
source: Something went wrong!
pl: Coś poszło nie tak!

# error-info
source: Please try again, and if the problem persists, contact the <a href="https://www.webperfekt.pl/">administrator</a>.
pl: Spróbuj jeszcze raz, jeśli problem się powtarza skontaktuj się z <a href="https://www.webperfekt.pl/">administratorem</a>.

# action-close
source: Close
pl: Zamknij

# routerLink-account
source: /account
pl: /konto

# title-logout
source: Log out
pl: Wyloguj się

# update-dialog-title
source: Application update!
pl: Aktualizacja aplikacji!

# update-dialog-info
source: Application update is available and will be installed.
pl: Aktualizacja aplikacji jest dostępna i zostanie zainstalowana.

# routerLink-register
source: /register
pl: /rejestracja

# chart-subtitle-year
source: Year this.dateTo.year()
pl: Rok this.dateTo.year()

# app-title
source: Lime Tracker - Epilepsy Journal
pl: Lime Tracker - Dziennik Epileptyka

# app-description
source: Track seizure events, medications, and identify triggers. This app helps people with epilepsy log and analyze seizures, medication, and potential triggers. The goal is to uncover patterns and insights to improve quality of life.
pl: Śledź leki i napady, identyfikuj czynniki, które je spowodowały. Ta aplikacja pomaga osobom chorym na epilepsję rejestrować i analizować napady, leki i potencjalne czynniki wyzwalające. Celem jest odkrycie wzorców i spostrzeżeń pozwalających poprawić jakość życia.

# app-lang
source: en
pl: pl

# app-screenshot-wide
source: assets/screenshots/en/1280x800-screenshot.png
pl: assets/screenshots/pl/1280x800-screenshot.png

# app-screenshot-narrow
source: assets/screenshots/en/750x1334-screenshot.png
pl: assets/screenshots/pl/750x1334-screenshot.png
